Revit 2026 API

# CurveLoopGetPlane Method

---

Gets the plane of the curve loop, if it is planar.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Plane GetPlane()
```
```vb
Public Function GetPlane As Plane
```
```cpp
public:
Plane^ GetPlane()
```
```fsharp
member GetPlane : unit -> Plane
```

#### Return Value

Plane The plane of the curve loop.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The curve loop does not lie in a single plane. |

#### Reference

CurveLoop Class

Autodesk.Revit.DB Namespace